package com.hamster.chat.enums;

/**
 * 返回数据
 */
public enum Enum_Response_Code {
    系统错误(-1, "系统错误"),
    成功(200, "成功"),
    失败(201, "失败"),
    未登录(-1001, "您还没有登录"),
    token已经过期(-1002, "您长时间未操作，请重新登录"),
    token非法(-1003, "token非法"),
    非法请求(-1004, "非法请求"),
    数据库写入失败(1001, "数据库写入失败"),
    逻辑验证未通过(1002, "逻辑验证未通过"),
    页面传参错误(1003, "页面参数错误[非用户输入参数]"),
    用户提交参数错误(1004, "用户提交参数错误为空或者不符合规则"),
    接口调用失败(1005, "接口调用失败"),
    抛出异常错误(1006, "系统错误,请联系客服！"),
    游戏已收盘(1008, "游戏已收盘"),
    游戏已维护(1018, "游戏已维护"),
    重复操作(1009, "重复操作"),
    登录超时(1102, "登录超时"),
    游戏未开盘(1103, "游戏未开盘"),
    loginedAnotherDevice(1111, "登录信息已失效,请重新登录"),
    token验证成功(1200, "token验证成功"),
    无法识别(4443, "无法识别"),
    维护(4444, "维护"),
    无可用资源(4004, "无可用资源"),
    无权限(5555, "游客无权限"),
    余额不足(1104, "余额不足"),
    层级错误(1105, "层级错误"),
    数据签名错误(1106, "数据签名错误"),
    必填参数不能为空(1107, "必填参数不能为空"),
    非法设备(1108, "非法设备"),
    暂无数据(2000, "暂无数据"),
    ;
    public int code;
    public String desc;

    private Enum_Response_Code(int _Code, String _Desc) {
        this.code = _Code;
        this.desc = _Desc;
    }

    public String getDesc() {
        return desc;
    }

    public int getCode() {
        return code;
    }
}
